## Plan Result (sbox_mgmt)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 24 to add, 0 to change, 24 to destroy.</code></pre>

* Replace
  * module.data_mgmt_zone.azurerm_key_vault_access_policy.purview
  * module.data_mgmt_zone.azurerm_private_endpoint.kv_endpoint
  * module.data_mgmt_zone.azurerm_private_endpoint.purview_endpoint[&#34;account&#34;]
  * module.data_mgmt_zone.azurerm_private_endpoint.purview_endpoint[&#34;portal&#34;]
  * module.data_mgmt_zone.azurerm_private_endpoint.synapse_private_link_hub_endpoint
  * module.data_mgmt_zone.azurerm_resource_group.new[0]
  * module.data_mgmt_zone.azurerm_role_assignment.name[0]
  * module.data_mgmt_zone.azurerm_synapse_private_link_hub.this
  * module.data_mgmt_zone.azurerm_user_assigned_identity.this
  * module.data_mgmt_zone.module.key_vault.azurerm_key_vault.kv
  * module.data_mgmt_zone.module.key_vault.azurerm_key_vault_access_policy.creator_access_policy
  * module.data_mgmt_zone.module.key_vault.azurerm_key_vault_access_policy.developer[0]
  * module.data_mgmt_zone.module.key_vault.azurerm_key_vault_access_policy.product_team_access_policy
  * module.data_mgmt_zone.module.key_vault.azurerm_monitor_diagnostic_setting.kv-ds
  * module.data_mgmt_zone.module.networking.azurerm_network_security_group.this[&#34;nsg&#34;]
  * module.data_mgmt_zone.module.networking.azurerm_network_security_rule.deny_inbound[&#34;nsg&#34;]
  * module.data_mgmt_zone.module.networking.azurerm_route.this[&#34;rt-default&#34;]
  * module.data_mgmt_zone.module.networking.azurerm_route_table.this[&#34;rt&#34;]
  * module.data_mgmt_zone.module.networking.azurerm_subnet.this[&#34;vnet-services&#34;]
  * module.data_mgmt_zone.module.networking.azurerm_subnet_network_security_group_association.this[&#34;nsg-vnet-services&#34;]
  * module.data_mgmt_zone.module.networking.azurerm_subnet_route_table_association.this[&#34;rt-vnet-services&#34;]
  * module.data_mgmt_zone.module.networking.azurerm_virtual_network.this[&#34;vnet&#34;]
  * module.data_mgmt_zone.module.vnet_peer_hub.azurerm_virtual_network_peering.initiator_to_target
  * module.data_mgmt_zone.module.vnet_peer_hub.azurerm_virtual_network_peering.target_to_initiator




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.data_mgmt_zone.azurerm_key_vault_access_policy.purview must be replaced
-/+ resource "azurerm_key_vault_access_policy" "purview" {
      - certificate_permissions = [] -> null
      ~ id                      = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/dlrm-ingest-mgmt-rg-sbox/providers/Microsoft.KeyVault/vaults/dlrm-ingest-mgmt-kv-sbox/objectId/b92d5586-c076-4598-bccf-4ba081889621" -> (known after apply)
      - key_permissions         = [] -> null
      ~ key_vault_id            = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/dlrm-ingest-mgmt-rg-sbox/providers/Microsoft.KeyVault/vaults/dlrm-ingest-mgmt-kv-sbox" # forces replacement -> (known after apply) # forces replacement
      - storage_permissions     = [] -> null
        # (3 unchanged attributes hidden)
    }

  # module.data_mgmt_zone.azurerm_private_endpoint.kv_endpoint must be replaced
-/+ resource "azurerm_private_endpoint" "kv_endpoint" {
      ~ custom_dns_configs       = [] -> (known after apply)
      ~ id                       = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/dlrm-ingest-mgmt-rg-sbox/providers/Microsoft.Network/privateEndpoints/dlrm-ingest-mgmt-kv-endpoint-sbox" -> (known after apply)
      ~ name                     = "dlrm-ingest-mgmt-kv-endpoint-sbox" -> "dlrm-ingest-kv-endpoint-sbox" # forces replacement
      ~ network_interface        = [
          - {
              - id   = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/dlrm-ingest-mgmt-rg-sbox/providers/Microsoft.Network/networkInterfaces/dlrm-ingest-mgmt-kv-endpoint-sbox.nic.36a79cd4-7f33-4811-926c-c02d06ae44ea"
              - name = "dlrm-ingest-mgmt-kv-endpoint-sbox.nic.36a79cd4-7f33-4811-926c-c02d06ae44ea"
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs = [
          - {
              - id                  = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/dlrm-ingest-mgmt-rg-sbox/providers/Microsoft.Network/privateEndpoints/dlrm-ingest-mgmt-kv-endpoint-sbox/privateDnsZoneGroups/endpoint-dnszonegroup/privateDnsZoneConfigs/privatelink.vaultcore.azure.net"
              - name                = "privatelink.vaultcore.azure.net"
              - private_dns_zone_id = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.vaultcore.azure.net"
              - record_sets         = [
                  - {
                      - fqdn         = "dlrm-ingest-mgmt-kv-sbox.privatelink.vaultcore.azure.net"
                      - ip_addresses = [
                          - "10.10.240.7",
                        ]
                      - name         = "dlrm-ingest-mgmt-kv-sbox"
                      - ttl          = 10
                      - type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
      ~ resource_group_name      = "dlrm-ingest-mgmt-rg-sbox" -> "dlrm-ingest-rg-sbox" # forces replacement
      ~ subnet_id                = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/dlrm-ingest-mgmt-rg-sbox/providers/Microsoft.Network/virtualNetworks/dlrm-ingest-mgmt-vnet-sbox/subnets/dlrm-ingest-mgmt-services-sbox" # forces replacement -> (known after apply) # forces replacement
      ~ tags                     = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "2023-11-08"
        } -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ private_dns_zone_group {
          ~ id                   = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/dlrm-ingest-mgmt-rg-sbox/providers/Microsoft.Network/privateEndpoints/dlrm-ingest-mgmt-kv-endpoint-sbox/privateDnsZoneGroups/endpoint-dnszonegroup" -> (known after apply)
            name                 = "endpoint-dnszonegroup"
            # (1 unchanged attribute hidden)
        }

      ~ private_service_connection {
          ~ name                           = "dlrm-ingest-mgmt-kv-endpoint-connection-sbox" -> "dlrm-ingest-kv-endpoint-connection-sbox" # forces replacement
          ~ private_connection_resource_id = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/dlrm-ingest-mgmt-rg-sbox/providers/Microsoft.KeyVault/vaults/dlrm-ingest-mgmt-kv-sbox" # forces replacement -> (known after apply) # forces replacement
          ~ private_ip_address             = "10.10.240.7" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.data_mgmt_zone.azurerm_private_endpoint.purview_endpoint["account"] must be replaced
-/+ resource "azurerm_private_endpoint" "purview_endpoint" {
      ~ custom_dns_configs       = [] -> (known after apply)
      ~ id                       = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/dlrm-ingest-mgmt-rg-sbox/providers/Microsoft.Network/privateEndpoints/dlrm-ingest-mgmt-purview-endpoint-account-sbox" -> (known after apply)
      ~ name                     = "dlrm-ingest-mgmt-purview-endpoint-account-sbox" -> "dlrm-ingest-purview-endpoint-account-sbox" # forces replacement
      ~ network_interface        = [
          - {
              - id   = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/dlrm-ingest-mgmt-rg-sbox/providers/Microsoft.Network/networkInterfaces/dlrm-ingest-mgmt-purview-endpoint-account-s.nic.50ebb6bc-46df-44fe-951f-5afd6ba17e41"
              - name = "dlrm-ingest-mgmt-purview-endpoint-account-s.nic.50ebb6bc-46df-44fe-951f-5afd6ba17e41"
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs = [
          - {
              - id                  = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/dlrm-ingest-mgmt-rg-sbox/providers/Microsoft.Network/privateEndpoints/dlrm-ingest-mgmt-purview-endpoint-account-sbox/privateDnsZoneGroups/endpoint-dnszonegroup/privateDnsZoneConfigs/privatelink.purview.azure.com"
              - name                = "privatelink.purview.azure.com"
              - private_dns_zone_id = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.purview.azure.com"
              - record_sets         = [
                  - {
                      - fqdn         = "mi-purview-sbox.privatelink.purview.azure.com"
                      - ip_addresses = [
                          - "10.10.240.6",
                        ]
                      - name         = "mi-purview-sbox"
                      - ttl          = 10
                      - type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
      ~ resource_group_name      = "dlrm-ingest-mgmt-rg-sbox" -> "dlrm-ingest-rg-sbox" # forces replacement
      ~ subnet_id                = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/dlrm-ingest-mgmt-rg-sbox/providers/Microsoft.Network/virtualNetworks/dlrm-ingest-mgmt-vnet-sbox/subnets/dlrm-ingest-mgmt-services-sbox" # forces replacement -> (known after apply) # forces replacement
      ~ tags                     = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "2023-11-08"
        } -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ private_dns_zone_group {
          ~ id                   = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/dlrm-ingest-mgmt-rg-sbox/providers/Microsoft.Network/privateEndpoints/dlrm-ingest-mgmt-purview-endpoint-account-sbox/privateDnsZoneGroups/endpoint-dnszonegroup" -> (known after apply)
            name                 = "endpoint-dnszonegroup"
            # (1 unchanged attribute hidden)
        }

      ~ private_service_connection {
          ~ name                           = "dlrm-ingest-mgmt-purview-endpoint-account-connection-sbox" -> "dlrm-ingest-purview-endpoint-account-connection-sbox" # forces replacement
          ~ private_ip_address             = "10.10.240.6" -> (known after apply)
            # (3 unchanged attributes hidden)
        }
    }

  # module.data_mgmt_zone.azurerm_private_endpoint.purview_endpoint["portal"] must be replaced
-/+ resource "azurerm_private_endpoint" "purview_endpoint" {
      ~ custom_dns_configs       = [
          - {
              - fqdn         = "web.purviewstudio.azure.com"
              - ip_addresses = [
                  - "10.10.240.5",
                ]
            },
        ] -> (known after apply)
      ~ id                       = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/dlrm-ingest-mgmt-rg-sbox/providers/Microsoft.Network/privateEndpoints/dlrm-ingest-mgmt-purview-endpoint-portal-sbox" -> (known after apply)
      ~ name                     = "dlrm-ingest-mgmt-purview-endpoint-portal-sbox" -> "dlrm-ingest-purview-endpoint-portal-sbox" # forces replacement
      ~ network_interface        = [
          - {
              - id   = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/dlrm-ingest-mgmt-rg-sbox/providers/Microsoft.Network/networkInterfaces/dlrm-ingest-mgmt-purview-endpoint-portal-sb.nic.92f5dd4e-f9fb-4a81-85bc-ae68a7d8400a"
              - name = "dlrm-ingest-mgmt-purview-endpoint-portal-sb.nic.92f5dd4e-f9fb-4a81-85bc-ae68a7d8400a"
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs = [
          - {
              - id                  = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/dlrm-ingest-mgmt-rg-sbox/providers/Microsoft.Network/privateEndpoints/dlrm-ingest-mgmt-purview-endpoint-portal-sbox/privateDnsZoneGroups/endpoint-dnszonegroup/privateDnsZoneConfigs/privatelink.purview.azure.com"
              - name                = "privatelink.purview.azure.com"
              - private_dns_zone_id = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.purview.azure.com"
              - record_sets         = []
            },
        ] -> (known after apply)
      ~ resource_group_name      = "dlrm-ingest-mgmt-rg-sbox" -> "dlrm-ingest-rg-sbox" # forces replacement
      ~ subnet_id                = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/dlrm-ingest-mgmt-rg-sbox/providers/Microsoft.Network/virtualNetworks/dlrm-ingest-mgmt-vnet-sbox/subnets/dlrm-ingest-mgmt-services-sbox" # forces replacement -> (known after apply) # forces replacement
      ~ tags                     = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "2023-11-08"
        } -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ private_dns_zone_group {
          ~ id                   = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/dlrm-ingest-mgmt-rg-sbox/providers/Microsoft.Network/privateEndpoints/dlrm-ingest-mgmt-purview-endpoint-portal-sbox/privateDnsZoneGroups/endpoint-dnszonegroup" -> (known after apply)
            name                 = "endpoint-dnszonegroup"
            # (1 unchanged attribute hidden)
        }

      ~ private_service_connection {
          ~ name                           = "dlrm-ingest-mgmt-purview-endpoint-portal-connection-sbox" -> "dlrm-ingest-purview-endpoint-portal-connection-sbox" # forces replacement
          ~ private_ip_address             = "10.10.240.5" -> (known after apply)
            # (3 unchanged attributes hidden)
        }
    }

  # module.data_mgmt_zone.azurerm_private_endpoint.synapse_private_link_hub_endpoint must be replaced
-/+ resource "azurerm_private_endpoint" "synapse_private_link_hub_endpoint" {
      ~ custom_dns_configs       = [] -> (known after apply)
      ~ id                       = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/dlrm-ingest-mgmt-rg-sbox/providers/Microsoft.Network/privateEndpoints/dlrm-ingest-mgmt-synapse-endpoint-sbox" -> (known after apply)
      ~ name                     = "dlrm-ingest-mgmt-synapse-endpoint-sbox" -> "dlrm-ingest-synapse-endpoint-sbox" # forces replacement
      ~ network_interface        = [
          - {
              - id   = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/dlrm-ingest-mgmt-rg-sbox/providers/Microsoft.Network/networkInterfaces/dlrm-ingest-mgmt-synapse-endpoint-sbox.nic.f1632f04-2d8f-4e8c-ac5f-4b4c2ce9f36d"
              - name = "dlrm-ingest-mgmt-synapse-endpoint-sbox.nic.f1632f04-2d8f-4e8c-ac5f-4b4c2ce9f36d"
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs = [
          - {
              - id                  = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/dlrm-ingest-mgmt-rg-sbox/providers/Microsoft.Network/privateEndpoints/dlrm-ingest-mgmt-synapse-endpoint-sbox/privateDnsZoneGroups/endpoint-dnszonegroup/privateDnsZoneConfigs/privatelink.azuresynapse.net"
              - name                = "privatelink.azuresynapse.net"
              - private_dns_zone_id = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.azuresynapse.net"
              - record_sets         = [
                  - {
                      - fqdn         = "web.privatelink.azuresynapse.net"
                      - ip_addresses = [
                          - "10.10.240.4",
                        ]
                      - name         = "web"
                      - ttl          = 10
                      - type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
      ~ resource_group_name      = "dlrm-ingest-mgmt-rg-sbox" -> "dlrm-ingest-rg-sbox" # forces replacement
      ~ subnet_id                = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/dlrm-ingest-mgmt-rg-sbox/providers/Microsoft.Network/virtualNetworks/dlrm-ingest-mgmt-vnet-sbox/subnets/dlrm-ingest-mgmt-services-sbox" # forces replacement -> (known after apply) # forces replacement
      ~ tags                     = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "2023-11-08"
        } -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ private_dns_zone_group {
          ~ id                   = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/dlrm-ingest-mgmt-rg-sbox/providers/Microsoft.Network/privateEndpoints/dlrm-ingest-mgmt-synapse-endpoint-sbox/privateDnsZoneGroups/endpoint-dnszonegroup" -> (known after apply)
            name                 = "endpoint-dnszonegroup"
            # (1 unchanged attribute hidden)
        }

      ~ private_service_connection {
          ~ name                           = "dlrm-ingest-mgmt-synapse-endpoint-connection-sbox" -> "dlrm-ingest-synapse-endpoint-connection-sbox" # forces replacement
          ~ private_connection_resource_id = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/dlrm-ingest-mgmt-rg-sbox/providers/Microsoft.Synapse/privateLinkHubs/dlrmingestmgmtsynapsehubsbox" # forces replacement -> (known after apply) # forces replacement
          ~ private_ip_address             = "10.10.240.4" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.data_mgmt_zone.azurerm_resource_group.new[0] must be replaced
-/+ resource "azurerm_resource_group" "new" {
      ~ id       = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/dlrm-ingest-mgmt-rg-sbox" -> (known after apply)
      ~ name     = "dlrm-ingest-mgmt-rg-sbox" -> "dlrm-ingest-rg-sbox" # forces replacement
      ~ tags     = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "2023-11-08"
        } -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.data_mgmt_zone.azurerm_role_assignment.name[0] must be replaced
-/+ resource "azurerm_role_assignment" "name" {
      ~ id                               = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/dlrm-ingest-mgmt-rg-sbox/providers/Microsoft.Authorization/roleAssignments/215d187b-7944-6dfc-af99-8a7d773dc509" -> (known after apply)
      ~ name                             = "215d187b-7944-6dfc-af99-8a7d773dc509" -> (known after apply)
      ~ principal_id                     = "b628bedb-ee70-418d-b33a-0f69eb9c72bd" # forces replacement -> (known after apply) # forces replacement
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/providers/Microsoft.Authorization/roleDefinitions/8e3af657-a8ff-443c-a75c-2fe8c4bcb635" -> (known after apply)
      ~ scope                            = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/dlrm-ingest-mgmt-rg-sbox" # forces replacement -> (known after apply) # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.data_mgmt_zone.azurerm_synapse_private_link_hub.this must be replaced
-/+ resource "azurerm_synapse_private_link_hub" "this" {
      ~ id                  = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/dlrm-ingest-mgmt-rg-sbox/providers/Microsoft.Synapse/privateLinkHubs/dlrmingestmgmtsynapsehubsbox" -> (known after apply)
      ~ name                = "dlrmingestmgmtsynapsehubsbox" -> "dlrmingestsynapsehubsbox" # forces replacement
      ~ resource_group_name = "dlrm-ingest-mgmt-rg-sbox" -> "dlrm-ingest-rg-sbox" # forces replacement
      ~ tags                = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "2023-11-08"
        } -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.data_mgmt_zone.azurerm_user_assigned_identity.this must be replaced
-/+ resource "azurerm_user_assigned_identity" "this" {
      ~ client_id           = "c62300f7-6861-4ddd-a158-6bdac9547051" -> (known after apply)
      ~ id                  = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/dlrm-ingest-mgmt-rg-sbox/providers/Microsoft.ManagedIdentity/userAssignedIdentities/dlrm-ingest-mgmt-identity-sbox" -> (known after apply)
      ~ name                = "dlrm-ingest-mgmt-identity-sbox" -> "dlrm-ingest-identity-sbox" # forces replacement
      ~ principal_id        = "b628bedb-ee70-418d-b33a-0f69eb9c72bd" -> (known after apply)
      ~ resource_group_name = "dlrm-ingest-mgmt-rg-sbox" -> "dlrm-ingest-rg-sbox" # forces replacement
      ~ tags                = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "2023-11-08"
        } -> (known after apply)
      ~ tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.data_mgmt_zone.module.key_vault.azurerm_key_vault.kv must be replaced
-/+ resource "azurerm_key_vault" "kv" {
      ~ access_policy                   = [
          - {
              - application_id          = ""
              - certificate_permissions = [
                  - "List",
                  - "Update",
                  - "Create",
                  - "Import",
                  - "Delete",
                  - "ManageContacts",
                  - "ManageIssuers",
                  - "GetIssuers",
                  - "ListIssuers",
                  - "SetIssuers",
                  - "DeleteIssuers",
                  - "Recover",
                ]
              - key_permissions         = [
                  - "List",
                  - "Update",
                  - "Create",
                  - "Import",
                  - "Delete",
                  - "Recover",
                ]
              - object_id               = "4d0554dd-fe60-424a-be9c-36636826d927"
              - secret_permissions      = [
                  - "List",
                  - "Set",
                  - "Delete",
                  - "Recover",
                ]
              - storage_permissions     = []
              - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
          - {
              - application_id          = ""
              - certificate_permissions = []
              - key_permissions         = []
              - object_id               = "b92d5586-c076-4598-bccf-4ba081889621"
              - secret_permissions      = [
                  - "Get",
                  - "List",
                  - "Set",
                  - "Delete",
                  - "Recover",
                  - "Backup",
                  - "Restore",
                  - "Purge",
                ]
              - storage_permissions     = []
              - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
          - {
              - application_id          = ""
              - certificate_permissions = [
                  - "Create",
                  - "Delete",
                  - "DeleteIssuers",
                  - "Get",
                  - "GetIssuers",
                  - "Import",
                  - "List",
                  - "ListIssuers",
                  - "SetIssuers",
                  - "Update",
                  - "ManageContacts",
                  - "ManageIssuers",
                ]
              - key_permissions         = [
                  - "Create",
                  - "List",
                  - "Get",
                  - "Delete",
                  - "Update",
                  - "Import",
                  - "Backup",
                  - "Restore",
                  - "Decrypt",
                  - "Encrypt",
                  - "UnwrapKey",
                  - "WrapKey",
                  - "Sign",
                  - "Verify",
                  - "GetRotationPolicy",
                ]
              - object_id               = "8e437d06-affa-4dca-a41a-1498238cb3b9"
              - secret_permissions      = [
                  - "Set",
                  - "List",
                  - "Get",
                  - "Delete",
                  - "Recover",
                  - "Purge",
                ]
              - storage_permissions     = []
              - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
          - {
              - application_id          = ""
              - certificate_permissions = [
                  - "Get",
                  - "List",
                ]
              - key_permissions         = [
                  - "Get",
                  - "List",
                ]
              - object_id               = "b2a1773c-a5ae-48b5-b5fa-95b0e05eee05"
              - secret_permissions      = [
                  - "Get",
                  - "List",
                ]
              - storage_permissions     = []
              - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
        ] -> (known after apply)
      - enable_rbac_authorization       = false -> null
      ~ id                              = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/dlrm-ingest-mgmt-rg-sbox/providers/Microsoft.KeyVault/vaults/dlrm-ingest-mgmt-kv-sbox" -> (known after apply)
      ~ name                            = "dlrm-ingest-mgmt-kv-sbox" -> "dlrm-ingest-kv-sbox" # forces replacement
      ~ resource_group_name             = "dlrm-ingest-mgmt-rg-sbox" -> "dlrm-ingest-rg-sbox" # forces replacement
      ~ tags                            = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "2023-11-08"
        } -> (known after apply)
      ~ vault_uri                       = "https://dlrm-ingest-mgmt-kv-sbox.vault.azure.net/" -> (known after apply)
        # (9 unchanged attributes hidden)

      ~ network_acls {
          - ip_rules                   = [] -> null
          - virtual_network_subnet_ids = [] -> null
            # (2 unchanged attributes hidden)
        }
    }

  # module.data_mgmt_zone.module.key_vault.azurerm_key_vault_access_policy.creator_access_policy must be replaced
-/+ resource "azurerm_key_vault_access_policy" "creator_access_policy" {
      ~ id                      = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/dlrm-ingest-mgmt-rg-sbox/providers/Microsoft.KeyVault/vaults/dlrm-ingest-mgmt-kv-sbox/objectId/8e437d06-affa-4dca-a41a-1498238cb3b9" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/dlrm-ingest-mgmt-rg-sbox/providers/Microsoft.KeyVault/vaults/dlrm-ingest-mgmt-kv-sbox" # forces replacement -> (known after apply) # forces replacement
      - storage_permissions     = [] -> null
        # (5 unchanged attributes hidden)
    }

  # module.data_mgmt_zone.module.key_vault.azurerm_key_vault_access_policy.developer[0] must be replaced
-/+ resource "azurerm_key_vault_access_policy" "developer" {
      ~ id                      = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/dlrm-ingest-mgmt-rg-sbox/providers/Microsoft.KeyVault/vaults/dlrm-ingest-mgmt-kv-sbox/objectId/b2a1773c-a5ae-48b5-b5fa-95b0e05eee05" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/dlrm-ingest-mgmt-rg-sbox/providers/Microsoft.KeyVault/vaults/dlrm-ingest-mgmt-kv-sbox" # forces replacement -> (known after apply) # forces replacement
      - storage_permissions     = [] -> null
        # (5 unchanged attributes hidden)
    }

  # module.data_mgmt_zone.module.key_vault.azurerm_key_vault_access_policy.product_team_access_policy must be replaced
-/+ resource "azurerm_key_vault_access_policy" "product_team_access_policy" {
      ~ id                      = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/dlrm-ingest-mgmt-rg-sbox/providers/Microsoft.KeyVault/vaults/dlrm-ingest-mgmt-kv-sbox/objectId/4d0554dd-fe60-424a-be9c-36636826d927" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/dlrm-ingest-mgmt-rg-sbox/providers/Microsoft.KeyVault/vaults/dlrm-ingest-mgmt-kv-sbox" # forces replacement -> (known after apply) # forces replacement
      - storage_permissions     = [] -> null
        # (5 unchanged attributes hidden)
    }

  # module.data_mgmt_zone.module.key_vault.azurerm_monitor_diagnostic_setting.kv-ds must be replaced
-/+ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
      ~ id                             = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/dlrm-ingest-mgmt-rg-sbox/providers/Microsoft.KeyVault/vaults/dlrm-ingest-mgmt-kv-sbox|dlrm-ingest-mgmt-kv-sbox" -> (known after apply)
      ~ log_analytics_destination_type = "AzureDiagnostics" -> (known after apply)
      ~ name                           = "dlrm-ingest-mgmt-kv-sbox" -> "dlrm-ingest-kv-sbox" # forces replacement
      ~ target_resource_id             = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/dlrm-ingest-mgmt-rg-sbox/providers/Microsoft.KeyVault/vaults/dlrm-ingest-mgmt-kv-sbox" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)

      - enabled_log {
          - category = "AuditEvent" -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      + enabled_log {
          + category = "AuditEvent"
        }

      - log {
          - category = "AuditEvent" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "AzurePolicyEvaluationDetails" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
    }

  # module.data_mgmt_zone.module.networking.azurerm_network_security_group.this["nsg"] must be replaced
-/+ resource "azurerm_network_security_group" "this" {
      ~ id                  = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/dlrm-ingest-mgmt-rg-sbox/providers/Microsoft.Network/networkSecurityGroups/dlrm-ingest-mgmt-nsg-sbox" -> (known after apply)
      ~ name                = "dlrm-ingest-mgmt-nsg-sbox" -> "dlrm-ingest-nsg-sbox" # forces replacement
      ~ resource_group_name = "dlrm-ingest-mgmt-rg-sbox" -> "dlrm-ingest-rg-sbox" # forces replacement
      ~ security_rule       = [
          - {
              - access                                     = "Deny"
              - description                                = "Default DenyInbound rule"
              - destination_address_prefix                 = "*"
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = []
              - destination_port_range                     = "*"
              - destination_port_ranges                    = []
              - direction                                  = "Inbound"
              - name                                       = "DenyAllInbound"
              - priority                                   = 4096
              - protocol                                   = "*"
              - source_address_prefix                      = "*"
              - source_address_prefixes                    = []
              - source_application_security_group_ids      = []
              - source_port_range                          = "*"
              - source_port_ranges                         = []
            },
        ] -> (known after apply)
      ~ tags                = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "2023-11-08"
        } -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.data_mgmt_zone.module.networking.azurerm_network_security_rule.deny_inbound["nsg"] must be replaced
-/+ resource "azurerm_network_security_rule" "deny_inbound" {
      - destination_address_prefixes               = [] -> null
      - destination_application_security_group_ids = [] -> null
      - destination_port_ranges                    = [] -> null
      ~ id                                         = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/dlrm-ingest-mgmt-rg-sbox/providers/Microsoft.Network/networkSecurityGroups/dlrm-ingest-mgmt-nsg-sbox/securityRules/DenyAllInbound" -> (known after apply)
        name                                       = "DenyAllInbound"
      ~ network_security_group_name                = "dlrm-ingest-mgmt-nsg-sbox" -> "dlrm-ingest-nsg-sbox" # forces replacement
      ~ resource_group_name                        = "dlrm-ingest-mgmt-rg-sbox" -> "dlrm-ingest-rg-sbox" # forces replacement
      - source_address_prefixes                    = [] -> null
      - source_application_security_group_ids      = [] -> null
      - source_port_ranges                         = [] -> null
        # (9 unchanged attributes hidden)
    }

  # module.data_mgmt_zone.module.networking.azurerm_route.this["rt-default"] must be replaced
-/+ resource "azurerm_route" "this" {
      ~ id                     = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/dlrm-ingest-mgmt-rg-sbox/providers/Microsoft.Network/routeTables/dlrm-ingest-mgmt-rt-sbox/routes/rt-default" -> (known after apply)
        name                   = "rt-default"
      ~ resource_group_name    = "dlrm-ingest-mgmt-rg-sbox" -> "dlrm-ingest-rg-sbox" # forces replacement
      ~ route_table_name       = "dlrm-ingest-mgmt-rt-sbox" -> "dlrm-ingest-rt-sbox" # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.data_mgmt_zone.module.networking.azurerm_route_table.this["rt"] must be replaced
-/+ resource "azurerm_route_table" "this" {
      ~ id                            = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/dlrm-ingest-mgmt-rg-sbox/providers/Microsoft.Network/routeTables/dlrm-ingest-mgmt-rt-sbox" -> (known after apply)
      ~ name                          = "dlrm-ingest-mgmt-rt-sbox" -> "dlrm-ingest-rt-sbox" # forces replacement
      ~ resource_group_name           = "dlrm-ingest-mgmt-rg-sbox" -> "dlrm-ingest-rg-sbox" # forces replacement
      ~ route                         = [
          - {
              - address_prefix         = "0.0.0.0/0"
              - name                   = "rt-default"
              - next_hop_in_ip_address = "10.10.200.36"
              - next_hop_type          = "VirtualAppliance"
            },
        ] -> (known after apply)
      ~ subnets                       = [
          - "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/dlrm-ingest-mgmt-rg-sbox/providers/Microsoft.Network/virtualNetworks/dlrm-ingest-mgmt-vnet-sbox/subnets/dlrm-ingest-mgmt-services-sbox",
        ] -> (known after apply)
      ~ tags                          = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "2023-11-08"
        } -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.data_mgmt_zone.module.networking.azurerm_subnet.this["vnet-services"] must be replaced
-/+ resource "azurerm_subnet" "this" {
      ~ enforce_private_link_endpoint_network_policies = false -> (known after apply)
      ~ enforce_private_link_service_network_policies  = false -> (known after apply)
      ~ id                                             = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/dlrm-ingest-mgmt-rg-sbox/providers/Microsoft.Network/virtualNetworks/dlrm-ingest-mgmt-vnet-sbox/subnets/dlrm-ingest-mgmt-services-sbox" -> (known after apply)
      ~ name                                           = "dlrm-ingest-mgmt-services-sbox" -> "dlrm-ingest-services-sbox" # forces replacement
      ~ private_endpoint_network_policies_enabled      = true -> (known after apply)
      ~ private_link_service_network_policies_enabled  = true -> (known after apply)
      ~ resource_group_name                            = "dlrm-ingest-mgmt-rg-sbox" -> "dlrm-ingest-rg-sbox" # forces replacement
      - service_endpoint_policy_ids                    = [] -> null
      - service_endpoints                              = [] -> null
      ~ virtual_network_name                           = "dlrm-ingest-mgmt-vnet-sbox" -> "dlrm-ingest-vnet-sbox" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.data_mgmt_zone.module.networking.azurerm_subnet_network_security_group_association.this["nsg-vnet-services"] must be replaced
-/+ resource "azurerm_subnet_network_security_group_association" "this" {
      ~ id                        = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/dlrm-ingest-mgmt-rg-sbox/providers/Microsoft.Network/virtualNetworks/dlrm-ingest-mgmt-vnet-sbox/subnets/dlrm-ingest-mgmt-services-sbox" -> (known after apply)
      ~ network_security_group_id = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/dlrm-ingest-mgmt-rg-sbox/providers/Microsoft.Network/networkSecurityGroups/dlrm-ingest-mgmt-nsg-sbox" # forces replacement -> (known after apply) # forces replacement
      ~ subnet_id                 = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/dlrm-ingest-mgmt-rg-sbox/providers/Microsoft.Network/virtualNetworks/dlrm-ingest-mgmt-vnet-sbox/subnets/dlrm-ingest-mgmt-services-sbox" # forces replacement -> (known after apply) # forces replacement
    }

  # module.data_mgmt_zone.module.networking.azurerm_subnet_route_table_association.this["rt-vnet-services"] must be replaced
-/+ resource "azurerm_subnet_route_table_association" "this" {
      ~ id             = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/dlrm-ingest-mgmt-rg-sbox/providers/Microsoft.Network/virtualNetworks/dlrm-ingest-mgmt-vnet-sbox/subnets/dlrm-ingest-mgmt-services-sbox" -> (known after apply)
      ~ route_table_id = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/dlrm-ingest-mgmt-rg-sbox/providers/Microsoft.Network/routeTables/dlrm-ingest-mgmt-rt-sbox" # forces replacement -> (known after apply) # forces replacement
      ~ subnet_id      = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/dlrm-ingest-mgmt-rg-sbox/providers/Microsoft.Network/virtualNetworks/dlrm-ingest-mgmt-vnet-sbox/subnets/dlrm-ingest-mgmt-services-sbox" # forces replacement -> (known after apply) # forces replacement
    }

  # module.data_mgmt_zone.module.networking.azurerm_virtual_network.this["vnet"] must be replaced
-/+ resource "azurerm_virtual_network" "this" {
      ~ dns_servers             = [] -> (known after apply)
      - flow_timeout_in_minutes = 0 -> null
      ~ guid                    = "2de60bba-4621-494e-a7ba-92dc9df81539" -> (known after apply)
      ~ id                      = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/dlrm-ingest-mgmt-rg-sbox/providers/Microsoft.Network/virtualNetworks/dlrm-ingest-mgmt-vnet-sbox" -> (known after apply)
      ~ name                    = "dlrm-ingest-mgmt-vnet-sbox" -> "dlrm-ingest-vnet-sbox" # forces replacement
      ~ resource_group_name     = "dlrm-ingest-mgmt-rg-sbox" -> "dlrm-ingest-rg-sbox" # forces replacement
      ~ subnet                  = [
          - {
              - address_prefix = "10.10.240.0/24"
              - id             = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/dlrm-ingest-mgmt-rg-sbox/providers/Microsoft.Network/virtualNetworks/dlrm-ingest-mgmt-vnet-sbox/subnets/dlrm-ingest-mgmt-services-sbox"
              - name           = "dlrm-ingest-mgmt-services-sbox"
              - security_group = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/dlrm-ingest-mgmt-rg-sbox/providers/Microsoft.Network/networkSecurityGroups/dlrm-ingest-mgmt-nsg-sbox"
            },
        ] -> (known after apply)
      ~ tags                    = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "2023-11-08"
        } -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.data_mgmt_zone.module.vnet_peer_hub.azurerm_virtual_network_peering.initiator_to_target must be replaced
-/+ resource "azurerm_virtual_network_peering" "initiator_to_target" {
      ~ id                           = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/dlrm-ingest-mgmt-rg-sbox/providers/Microsoft.Network/virtualNetworks/dlrm-ingest-mgmt-vnet-sbox/virtualNetworkPeerings/dlrm-ingest-mgmt-vnet-sbox-to-hub" -> (known after apply)
      ~ name                         = "dlrm-ingest-mgmt-vnet-sbox-to-hub" -> "dlrm-ingest-vnet-sbox-to-hub" # forces replacement
      ~ resource_group_name          = "dlrm-ingest-mgmt-rg-sbox" -> "dlrm-ingest-rg-sbox" # forces replacement
      ~ virtual_network_name         = "dlrm-ingest-mgmt-vnet-sbox" -> "dlrm-ingest-vnet-sbox" # forces replacement
        # (5 unchanged attributes hidden)
    }

  # module.data_mgmt_zone.module.vnet_peer_hub.azurerm_virtual_network_peering.target_to_initiator must be replaced
-/+ resource "azurerm_virtual_network_peering" "target_to_initiator" {
      ~ id                           = "/subscriptions/ea3a8c1e-af9d-4108-bc86-a7e2d267f49c/resourceGroups/hmcts-hub-sbox-int/providers/Microsoft.Network/virtualNetworks/hmcts-hub-sbox-int/virtualNetworkPeerings/hub-to-dlrm-ingest-mgmt-vnet-sbox" -> (known after apply)
      ~ name                         = "hub-to-dlrm-ingest-mgmt-vnet-sbox" -> "hub-to-dlrm-ingest-vnet-sbox" # forces replacement
      ~ remote_virtual_network_id    = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/dlrm-ingest-mgmt-rg-sbox/providers/Microsoft.Network/virtualNetworks/dlrm-ingest-mgmt-vnet-sbox" -> "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/dlrm-ingest-rg-sbox/providers/Microsoft.Network/virtualNetworks/dlrm-ingest-vnet-sbox" # forces replacement
        # (6 unchanged attributes hidden)
    }

Plan: 24 to add, 0 to change, 24 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":4,"Program":"tfcmt","SHA1":"","Target":"sbox_mgmt","Vars":{}} -->